app/views/posts/show.html.erb

    <h2>コメント一覧</h2>
    <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1