app/controllers/comments_controller.rb

  def load_post
    @post = Post.find(params[:post_id]);
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY id DESC LIMIT 1  [["id", "4"]]

  def create
    @comment = @post.comments.create(params[:comment])
---
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "あべし"], ["commenter", "あべし"], ["created_at", Fri, 11 Jan 2013 08:25:22 UTC +00:00], ["post_id", 2], ["updated_at", Fri, 11 Jan 2013 08:25:22 UTC +00:00]]