app/controllers/posts_controller.rb

  def index
    Time.zone = 'Asia/Tokyo'
    @posts = Post.all(:include => [:user], :order => 'id desc')
---
SELECT "posts".* FROM "posts" INNER JOIN "users" ON "users"."id" = "posts"."user_id"