app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY id DESC, id desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    Time.zone = 'Asia/Tokyo'
    @posts = Post.page(params[:page]).per(5)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY id DESC LIMIT 1  [["id", "7"]]
---
  def show
    Time.zone = 'Asia/Tokyo'
    @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    if current_user == nil
      redirect_to root_path
    end
    @post = Post.find(params[:id])

INSERT INTO "posts" ("content", "content2", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "testererere"], ["content2", "test"], ["created_at", Fri, 11 Jan 2013 15:56:48 UTC +00:00], ["name", "tes"], ["title", "tester"], ["updated_at", Fri, 11 Jan 2013 15:56:48 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "posts" SET "title" = '画像のテスト', "content" = '<p>testererere</p>
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])