app/controllers/sessions_controller.rb

INSERT INTO "users" ("account", "account_name", "created_at", "email", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."account" = 'sumida@d-a.co.jp' LIMIT 1
---
  def login
    user = User.find_by_account(params[:account])